In [31]:
import pandas as pd
import pyodbc

In [32]:
# IMPORTS DO NOT EDIT THIS CELL
import sqlite3
import csv
from sqlalchemy import create_engine
%load_ext sql_magic

# Load SQLite database
engine  = create_engine("sqlite:///stock_historical_data.db")
%config SQL.conn_name ='engine'

The sql_magic extension is already loaded. To reload it, use:
  %reload_ext sql_magic

In [33]:
data=pd.read_csv("historical_stock_data.csv")
df.head(5)

,2015-10-27,65.17,65.17.1,63.056,63.187,36229,-3.0428111094061747,-1.983000000000004,tmusp.u
0,2015-10-28,64.449,64.449,63.431,64.085,61025,-0.564788,-0.364,tmusp.u
1,2015-10-29,63.514,63.514,60.858,61.511,139471,-3.153635,-2.003,tmusp.u
2,2015-10-30,61.119,62.363,60.950,62.214,46703,1.791587,1.095,tmusp.u
3,2015-11-02,61.970,62.859,61.970,62.821,411208,1.373245,0.851,tmusp.u
4,2015-11-03,63.027,63.440,62.579,63.383,114355,0.564837,0.356,tmusp.u

In [34]:
#DO NOT EDIT THIS CELL
conn = sqlite3.connect('stock_historical_data.db')
cursor = conn.cursor()

In [35]:
%%read_sql
--DO NOT EDIT THIS CELL
DROP TABLE IF EXISTS "historical_stocks_data";

--CREATE TABLE
CREATE TABLE "historical_stocks_data" (    
    "stock_date" VARCHAR ( 56 ),
    "open_value" VARCHAR ( 56 ),
    "high_value" VARCHAR ( 56 ),
    "low_value" VARCHAR ( 56 ),
    "close_value" VARCHAR ( 56 ),
    "volume_traded" VARCHAR ( 56 ),
    "daily_percent_change" VARCHAR ( 56 ),
    "value_change" VARCHAR ( 56 ),
    "company_name" VARCHAR ( 56 )
)

Query started at 06:19:07 PM E. Africa Standard Time; Query executed in 0.00 m

In [36]:
#DO NOT EDIT CELL
#Load data into Product table
with open('historical_stock_data.csv','r') as fin: # `with` statement available in 2.5+
    # csv.DictReader uses first line in file for column headings by default
    dr = csv.DictReader(fin) # comma is default delimiter
    #to_db = [(i['Width'],i[Volume_litre'],i['Warranty'],i['Weight_kg'],i["ItemDescription"],i['Price']) for i in dr]
    to_db =[(i["stock_date"], i["open_value"], i["high_value"], i["low_value"], i["close_value"], i["volume_traded"], i["daily_percent_change"],i["value_change"], i["company_name"]) for i in dr]

cursor.executemany("INSERT INTO historical_stocks_data VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?);", to_db)
conn.commit()

In [38]:
%%read_sql
-- #Use this section to explore the database by writing your own queries
SELECT count(*) FROM historical_stocks_data
--LIMIT 2;

Query started at 06:28:09 PM E. Africa Standard Time; Query executed in 0.01 m

   count(*)
0   2054899

In [39]:
%%read_sql
-- #Use this section to explore the database by writing your own queries
SELECT sum(value_change) FROM historical_stocks_data

Query started at 07:44:07 PM E. Africa Standard Time; Query executed in 0.15 m

   sum(value_change)
0       -8977.026548

In [41]:
%%read_sql
-- #Use this section to explore the database by writing your own queries
SELECT avg(value_change) FROM historical_stocks_data

Query started at 07:47:15 PM E. Africa Standard Time; Query executed in 0.04 m

   avg(value_change)
0          -0.004369

In [42]:
%%read_sql
-- #Use this section to explore the database by writing your own queries
SELECT avg(open_value) FROM historical_stocks_data

Query started at 07:51:06 PM E. Africa Standard Time; Query executed in 0.02 m

   avg(open_value)
0        24.828453

In [43]:
%%read_sql
-- #Use this section to explore the database by writing your own queries
SELECT avg(close_value) FROM historical_stocks_data

Query started at 07:51:59 PM E. Africa Standard Time; Query executed in 0.02 m

   avg(close_value)
0         24.824084

In [45]:
%%read_sql
-- #Use this section to explore the database by writing your own queries
SELECT min(stock_date ), max(stock_date ) FROM historical_stocks_data

Query started at 07:54:35 PM E. Africa Standard Time; Query executed in 0.03 m

  min(stock_date ) max(stock_date )
0       1962-01-02       2017-11-10

In [48]:
%%read_sql
-- #Use this section to explore the database by writing your own queries
SELECT COUNT(DISTINCT company_name) FROM historical_stocks_data

Query started at 09:00:53 PM E. Africa Standard Time; Query executed in 0.18 m

   COUNT(DISTINCT company_name)
0                           995